<?php
/**
 * FormIt
 *
 * Copyright 2009-2012 by Shaun McCormick <shaun@modx.com>
 *
 * FormIt is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * FormIt is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * FormIt; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package formit
 */
/**
 * Array of Russian Federation regions
 * @package formit
 */
return array(
    '22' => 'Алтайский край',
	'28' => 'Амурская область',
	'29' => 'Архангельская область',
	'30' => 'Астраханская область',
	'31' => 'Белгородская область',
	'32' => 'Брянская область',
	'33' => 'Владимирская область',
	'34' => 'Волгоградская область',
	'35' => 'Вологодская область',
	'36' => 'Воронежская область',
	'79' => 'Еврейская автономная область',
	'75' => 'Забайкальский край',
	'37' => 'Ивановская область',
	'99' => 'Иные территории, включая город и космодром Байконур',
	'38' => 'Иркутская область',
	'07' => 'Кабардино-Балкарская Республика',
	'39' => 'Калининградская область',
	'40' => 'Калужская область',
	'41' => 'Камчатский край',
	'09' => 'Карачаево-Черкесская Республика',
	'42' => 'Кемеровская область',
	'43' => 'Кировская область',
	'44' => 'Костромская область',
	'23' => 'Краснодарский край',
	'24' => 'Красноярский край',
	'45' => 'Курганская область',
	'46' => 'Курская область',
	'47' => 'Ленинградская область',
	'48' => 'Липецкая область',
	'49' => 'Магаданская область',
	'77' => 'Москва',
	'50' => 'Московская область',
	'51' => 'Мурманская область',
	'83' => 'Ненецкий автономный округ',
	'52' => 'Нижегородская область',
	'53' => 'Новгородская область',
	'54' => 'Новосибирская область',
	'55' => 'Омская область',
	'56' => 'Оренбургская область',
	'57' => 'Орловская область',
	'58' => 'Пензенская область',
	'59' => 'Пермский край',
	'25' => 'Приморский край',
	'60' => 'Псковская область',
	'01' => 'Республика Адыгея (Адыгея)',
	'04' => 'Республика Алтай',
	'02' => 'Республика Башкортостан',
	'03' => 'Республика Бурятия',
	'05' => 'Республика Дагестан',
	'06' => 'Республика Ингушетия',
	'08' => 'Республика Калмыкия',
	'10' => 'Республика Карелия',
	'11' => 'Республика Коми',
	'91' => 'Республика Крым',
	'12' => 'Республика Марий Эл',
	'13' => 'Республика Мордовия',
	'14' => 'Республика Саха (Якутия)',
	'15' => 'Республика Северная Осетия - Алания',
	'16' => 'Республика Татарстан (Татарстан)',
	'17' => 'Республика Тыва',
	'19' => 'Республика Хакасия',
	'61' => 'Ростовская область',
	'62' => 'Рязанская область',
	'63' => 'Самарская область',
	'78' => 'Санкт-Петербург',
	'64' => 'Саратовская область',
	'65' => 'Сахалинская область',
	'66' => 'Свердловская область',
	'92' => 'Севастополь',
	'67' => 'Смоленская область',
	'26' => 'Ставропольский край',
	'68' => 'Тамбовская область',
	'69' => 'Тверская область',
	'70' => 'Томская область',
	'71' => 'Тульская область',
	'72' => 'Тюменская область',
	'18' => 'Удмуртская Республика',
	'73' => 'Ульяновская область',
	'27' => 'Хабаровский край',
	'86' => 'Ханты-Мансийский автономный округ',
	'74' => 'Челябинская область',
	'20' => 'Чеченская Республика',
	'21' => 'Чувашская Республика',
	'87' => 'Чукотский автономный округ',
	'89' => 'Ямало-Ненецкий автономный округ',
	'76' => 'Ярославская область',
);

