<?php

/**
 * FormIt
 *
 * Copyright 2020 by Sterc <modx@sterc.nl>
 */

$_lang['prop_formit.hooks_desc']                                = 'Розділений комами список хуків які будуть виконуватися по черзі після того, як форма пройде перевірку. Якщо якийсь із хуків поверне false, то наступні хуки не будуть виконані. Хук також може бути ім\'ям сніпету, цей сніпет буде виконаний як хук.';
$_lang['prop_formit.prehooks_desc']                             = 'Розділений комами список хуків які будуть виконуватися по черзі після того, як форма буде завантажена. Якщо якийсь із хуків поверне false, то наступні хуки не будуть виконані. Наприклад: можна попередньо встановлювати значення полів форми за допомогою $scriptProperties[`hook`]->fields[`fieldname`]. Хук також може бути ім\'ям сніпету, цей сніпет буде виконаний як хук.';
$_lang['prop_formit.submitvar_desc']                            = 'Якщо встановлено значення, то обробка форми не почнеться поки POST параметр з цим ім\'ям не буде переданий.';
$_lang['prop_formit.validate_desc']                             = 'Розділений комами список полів для перевірки, для кожного поля пишеться ім\'я:валідатор (тобто: username:required, email:required). Валідатори можуть бути об\'єднані через двокрапку, наприклад email:email:required. Цей параметр може бути заданий на декількох рядках.';
$_lang['prop_formit.errtpl_desc']                               = 'Шаблон повідомлення про помилку.';
$_lang['prop_formit.validationerrormessage_desc']               = 'Загальне повідомлення про помилку для установки в якості плейсхолдера в разі якщо валідація не пройшла. Може містити [[+errors]], якщо ви хочете показати список усіх помилок.';
$_lang['prop_formit.validationerrorbulktpl_desc']               = 'HTML шаблон (tpl), який використовується для кожної окремої помилки в загальному значенні повідомлення про помилку при валідації.';
$_lang['prop_formit.customvalidators_desc']                     = 'Розділений комами список імен користувальницьких валідаторів (сніпетів), які ви плануєте використовувати в цій формі. Призначені для користувача валідатори повинні бути обов\'язково вказані в цьому параметрі, інакше вони не будуть працювати.';
$_lang['prop_formit.trimvaluesdeforevalidation_desc']           = 'Чи обрізати пробіли від початку і кінця значення до початку валідації. За замовчуванням true.';
$_lang['prop_formit.clearfieldsonsuccess_desc']                 = 'Якщо значення true, очистить поля при успішному надсиланні форми без редиректу.';
$_lang['prop_formit.successmessage_desc']                       = 'Значення плейсхолдера для повідомлення про успіх. Ім\'я плейсхолдера встановлюється в параметрі &successMessagePlaceholder, за замовчуванням «fi.successMessage».';
$_lang['prop_formit.successmessageplaceholder_desc']            = 'Плейсхолдер для повідомлення про успіх.';
$_lang['prop_formit.store_desc']                                = 'Якщо встановлено true, дані передані через форму будуть зберігатись в кеші, для подальшого їх використання за допомогою сніпету FormItRetriever.';
$_lang['prop_formit.storetime_desc']                            = 'Якщо для `store` задано значення true, то цей параметр вказує час (в секундах) для зберігання даних із надісланої форми. За замовчуванням п\'ять хвилин.';
$_lang['prop_formit.storelocation_desc']                        = 'Якщо для `store` задано значення true, то цей параметр вказує місце розташування кешу даних з форм. За замовчуванням використовується кеш MODX.';
$_lang['prop_formit.allowfiles_desc']                           = 'Якщо встановлено значення 0, файли не будуть відправлені в форму.';
$_lang['prop_formit.placeholderprefix_desc']                    = 'Префікс для всіх плейсхолдерів, втановлених FormIt для полів. За замовчуванням `fi.`';
$_lang['prop_formit.redirectto_desc']                           = 'Хук `redirect`. У цьому параметрі треба вказати ідентифікатор ресурсу на який буде відбуватися редирект після успішного відправлення форми.';
$_lang['prop_formit.redirectparams_desc']                       = 'JSON-масив параметрів для передачі в хук `redirect`, який буде передаватися при редиректі.';
$_lang['prop_formit.recaptchajs_desc']                          = 'Хук `recaptcha`. JSON об\'єкт який містить в собі настройки для віджета reCAPTCHA.';
$_lang['prop_formit.recaptchaheight_desc']                      = 'Хук `recaptcha`. Висота віджета reCAPTCHA.';
$_lang['prop_formit.recaptchatheme_desc']                       = 'Хук `recaptcha`. Тема оформлення для віджета reCAPTCHA.';
$_lang['prop_formit.recaptchawidth_desc']                       = 'Хук `recaptcha`. Ширина віджета reCAPTCHA.';
$_lang['prop_formit.spamemailfields_desc']                      = 'Хук `spam`. Розділений комами список полів форми, які містять адреси електронної пошти для перевірки на причетність до спаму.';
$_lang['prop_formit.spamcheckip_desc']                          = 'Хук `spam`. Якщо цей параметр встановлений в true, то буде перевірятися IP-адреса відправника форми на причетність до спаму.';
$_lang['prop_formit.emailbcc_desc']                             = 'Хук `email`. Розділений комами список адрес електронної пошти на які треба послати приховану копію листа (BCC).';
$_lang['prop_formit.emailbccname_desc']                         = 'Хук `email`. Необов\'язковий параметр. Розділений комами список імен власників адрес електронної пошти зазначених в пункті `emailBCC`.';
$_lang['prop_formit.emailcc_desc']                              = 'Хук `email`. Розділений комами список адрес електронної пошти на які треба надіслати копію листа.';
$_lang['prop_formit.emailccname_desc']                          = 'Хук `email`. Необов\'язковий параметр. Розділений комами список імен власників адрес електронної пошти зазначених в пункті `emailCC`.';
$_lang['prop_formit.emailto_desc']                              = 'Хук `email`. Розділений комами список адрес електронної пошти на які треба надіслати листа.';
$_lang['prop_formit.emailtoname_desc']                          = 'Хук `email`. Необов\'язковий параметр. Розділений комами список імен власників адрес електронної пошти зазначених в пункті `emailTo`.';
$_lang['prop_formit.emailfrom_desc']                            = 'Хук `email`. Необов\'язковий параметр. Якщо цей параметр встановлений, то він буде визначати адресу електронної пошти відправника листа. Якщо не встановлено, то спочатку адреса електронної пошти буде шукатися в даних форми в полі з ім\'ям `email`, якщо це поле не буде знайдено, то буде використовуватися адреса електронної пошти з системної настройки `emailsender`.';
$_lang['prop_formit.emailfromname_desc']                        = 'Хук `email`. Необов\'язковий параметр. Ім\'я відправника листа.';
$_lang['prop_formit.emailreplyto_desc']                         = 'Хук `email`. Необов\'язковий параметр. Адреса електронної пошти для відповіді на лист.';
$_lang['prop_formit.emailreplytoname_desc']                     = 'Хук `email`. Необов\'язковий параметр. Ім\'я власника адреси електронної пошти який використовується для відповіді на лист.';
$_lang['prop_formit.emailreturnpath_desc']                      = 'Необов\'язковий параметр. Якщо `email` встановлений як хук і цей параметр включений, то буде вказано Return-path: адреса для електронної пошти. Якщо не увімкнено, то буде приймати значення властивості `emailFrom`.';
$_lang['prop_formit.emailsubject_desc']                         = 'Хук `email`. У цьому параметрі можна вказати тему електронного листа.';
$_lang['prop_formit.emailusefieldforsubject_desc']              = 'Якщо поле `subject` використовується в формі і цей параметр встановлений в true, то вміст цього поля буде використовуватися як тема електронного листа.';
$_lang['prop_formit.emailhtml_desc']                            = 'Хук `email`. Необов\'язковий параметр. Цей параметр включає використання HTML розмітки в електронному листі. За замовчуванням включено.';
$_lang['prop_formit.emailconvertnewlines_desc']                 = 'Якщо true та emailHtml встановлений в 1, то в листі перенесення рядка буде конвертовано в тег BR.';
$_lang['prop_formit.emailmultiseparator_desc']                  = 'Роздільник за замовчуванням для списку значень, що відправляються через поля типу checkboxes/multi-selects. За замовчуванням використовується перенос рядка.';
$_lang['prop_formit.emailmultiwrapper_desc']                    = 'Оберне кожне значення в списку полів відправлених з полів типу checkboxes/multi-selects. За замовчуванням передаються тільки значення, без обгортки.';

$_lang['prop_fiar.fiartpl_desc']                                = 'Хук `FormItAutoResponder`. Обов\'язковий параметр. Ім\'я чанка який буде використовуватися як шаблон листа для автоматичної відповіді.';
$_lang['prop_fiar.fiartofield_desc']                            = 'Хук `FormItAutoResponder`. Поле форми яке буде використано як адресу на яку треба відправити автоматичну відповідь.';
$_lang['prop_fiar.fiarbcc_desc']                                = 'Хук `FormItAutoResponder`. Розділений комами список адрес електронної пошти на які треба надіслати приховану копію листа (BCC).';
$_lang['prop_fiar.fiarbccname_desc']                            = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Розділений комами список імен власників адрес електронної пошти зазначених в параметрі `emailBCC`.';
$_lang['prop_fiar.fiarcc_desc']                                 = 'Хук `FormItAutoResponder`. Розділений комами список адрес електронної пошти на які треба надіслати копію листа.';
$_lang['prop_fiar.fiarccname_desc']                             = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Розділений комами список імен власників адрес електронної пошти зазначених в пункті `emailCC`.';
$_lang['prop_fiar.fiarfrom_desc']                               = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Якщо цей параметр встановлений, то він буде визначати адресу електронної пошти відправника листа. Якщо не встановлено, то спочатку адреса електронної пошти буде шукатися в даних форми в полі з ім\'ям `email`, якщо це поле не буде знайдено, то буде використовуватися адреса електронної пошти з системного налаштування `emailsender`.';
$_lang['prop_fiar.fiarfromname_desc']                           = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Ім\'я відправника листа.';
$_lang['prop_fiar.fiarreplyto_desc']                            = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Адреса електронної пошти для відповіді на лист.';
$_lang['prop_fiar.fiarreplytoname_desc']                        = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Ім\'я власника адреси електронної пошти яке використовується для відповіді на лист.';
$_lang['prop_fiar.fiarsubject_desc']                            = 'Хук `FormItAutoResponder`. Тема листа.';
$_lang['prop_fiar.fiarhtml_desc']                               = 'Хук `FormItAutoResponder`. Необов\'язковий параметр. Вмикає або вимикає використання HTML розмітки в електронному листі. За замовчуванням включено.';

$_lang['prop_fir.placeholderprefix_desc']                       = 'Префікс який використовується плейсхолдерами, що виводять збережені дані форми.';
$_lang['prop_fir.redirecttoonnotfound_desc']                    = 'Ідентифікатор ресурсу на який відбудеться редирект, якщо дані не знайдені.';
$_lang['prop_fir.eraseonload_desc']                             = 'Якщо включено, збережені дані форми будуть стиратися при першому завантаженні. Настійно рекомендується залишити цей параметр вимкненим. Увімкніть його якщо ви хочете щоб дані завантажувалися тільки один раз.';
$_lang['prop_fir.storelocation_desc']                           = 'Якщо для `store` задано значення true, то це вказує місце розташування кешу даних з форм. За замовчуванням використовується кеш MODX.';

$_lang['prop_math.mathminrange_desc']                           = 'Хук `math`. Мінімальний діапазон для кожного числа в рівнянні.';
$_lang['prop_math.mathmaxrange_desc']                           = 'Хук `math`. Максимальний діапазон для кожного числа в рівнянні.';
$_lang['prop_math.mathfield_desc']                              = 'Хук `math`. Ім\'я поля введення для відповіді.';
$_lang['prop_math.mathop1field_desc']                           = 'Хук `math`. Ім\'я поля для першого числа в рівнянні.';
$_lang['prop_math.mathop2field_desc']                           = 'Хук `math`. Ім\'я поля для другого числа в рівнянні.';
$_lang['prop_math.mathoperatorfield_desc']                      = 'Хук `math`. Ім\'я поля для оператора в рівнянні.';

$_lang['prop_fico.allgrouptext_desc']                           = 'Необов\'язковий параметр. Якщо встановлено і використовується &prioritized, то буде використовуватися мітка (label) для всіх інших країн в групах опцій.';
$_lang['prop_fico.optgrouptpl_desc']                            = 'Необов\'язковий параметр. Якщо встановлено і використовується &prioritized, то це буде чанк tpl для розмітки групи опцій.';
$_lang['prop_fico.limited_desc']                                = 'Необов\'язковий параметр. Розділений комами список кодів ISO для обраних країн, повний список яких буде обмежений.';
$_lang['prop_fico.prioritized_desc']                            = 'Необов\'язковий параметр. Розділений комами список кодів ISO для країн, які будуть переміщувати їх в пріоритетну групу «Частих відвідувачів» у верхній частині випадаючого списку. Це можна використовувати для країн, які часто вибирають.';
$_lang['prop_fico.prioritizedgrouptext_desc']                   = 'Необов\'язковий параметр. Якщо встановлено і використовується &prioritized, то використовується текстова мітка для групи параметрів з пріоритетом.';
$_lang['prop_fico.selected_desc']                               = 'Значення країни для вибору.';
$_lang['prop_fico.selectedattribute_desc']                      = 'Необов\'язковий параметр. Атрибут HTML для додавання до обраної країні.';
$_lang['prop_fico.toplaceholder_desc']                          = 'Необов\'язковий параметр. Використовуйте цей параметр, щоб виводити через плейсхолдер замість безпосереднього виведення на екран.';
$_lang['prop_fico.tpl_desc']                                    = 'Необов\'язковий параметр. Чанк для виведення кожної країни в випадаючому списку.';
$_lang['prop_fico.useisocode_desc']                             = 'Якщо 1, буде використовувати код країни ISO для значення. Якщо 0, буде використовувати назву країни.';
$_lang['prop_fico.country_desc']                                = 'Необов\'язковий параметр. Встановіть для використання альтернативного файлу зі списком країн для завантаження в значення поля.';

$_lang['prop_fiso.country_desc']                                = 'Необов\'язковий параметр. Встановіть для використання альтернативного файлу зі списком штатів для завантаження в значення поля.';
$_lang['prop_fiso.selected_desc']                               = 'Значення країни для вибору.';
$_lang['prop_fiso.selectedattribute_desc']                      = 'Необов\'язковий параметр. Атрибут HTML для додавання до обраної країни.';
$_lang['prop_fiso.toplaceholder_desc']                          = 'Необов\'язковий параметр. Використовуйте цей параметр, щоб виводити через плейсхолдер замість безпосереднього виведення на екран.';
$_lang['prop_fiso.tpl_desc']                                    = 'Необов\'язковий параметр. Чанк для виведення кожної країни в випадаючому списку.';
$_lang['prop_fiso.useabbr_desc']                                = 'Якщо 1, буде використовуватися абревіатура штату для значення. Якщо 0, буде використовуватися повна назва штату.';

$_lang['formit.opt_blackglass']                                 = 'Black Glass';
$_lang['formit.opt_clean']                                      = 'Clean';
$_lang['formit.opt_red']                                        = 'Red';
$_lang['formit.opt_white']                                      = 'White';
$_lang['formit.opt_cache']                                      = 'MODX Cache';
$_lang['formit.opt_session']                                    = 'Сесія';
$_lang['prop_formit.savetmpfiles_desc']                         = 'Якщо встановлено значення 1, FormIt буде зберігати відправлені файли в тимчасовій папці.';
$_lang['prop_formit.attachfiles_desc']                          = 'Якщо true, FormIt додасть всі поля файлу як вкладення в електронний лист.';
